/*1
- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
    Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.*/
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

friends.length >= 3 ? console.log('це великий масив') : console.log('це маленький масив');


/*2
- Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
    Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.*/
let a = 1;
let b = 7;
let c = 9;

if (a > b && a < c || a < b && a > c) {
    console.log(a);
} else if (b > a && b < c || b < a && b > c) {
    console.log(b, 'знаходиться між a та b');
} else if (c > a && c < b || c < a && c > b) {
    console.log(c);
} else {
    console.log('жодне з чисел не є середнім')
}

/*3
- Перепишіть конструкцію if з використанням умовного оператора '?':
let result;
if (a + b < 4) {
    result = 'Мало';
} else {
    result = 'Багато';
}*/
let result;

(a + b < 4) ? result = 'Мало' : result = 'Багато';

console.log(result);


/*4
- Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
напишіть це тернарним оператором*/
let number = -100;

number > 0
    ? console.log('число позитивне')
    : number < 0
        ? console.log('число негативне')
        : console.log('0');

/*5
- У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
    Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)*/
let test = true;

switch (test) {
    case true:
        console.log('Вірно');
        break;
    default:
        console.log('Неправильно');
}

if (test === true) {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}

test === true
    ? console.log('Вірно')
    : console.log('Неправильно');

/*6
- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!*/
let rightAnswer = 'ECMAScript'.toLowerCase();
let usersAnswer = prompt('Яка «офіційна» назва JavaScript?').toLowerCase();

if (rightAnswer === usersAnswer) {
    alert('Правильно!');
} else {
    alert('Не знаєте? ECMAScript!!');
}

/*7
    - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
Користувач вводить номер квартири просто в змінні або через prompt('') .
    Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.*/
let flatNumber = +prompt('Номер Вашої квартири?')

if (flatNumber >= 1 && flatNumber < 20) {
    alert('Ій під\'їзд');
} else if (flatNumber >= 21 && flatNumber < 49) {
    alert('ІІй під\'їзд');
} else if (flatNumber >= 49 && flatNumber < 90) {
    alert('ІІІй під\'їзд');
} else {
    console.log('У цьому будинку відсутня квартира з таким номером')
}


/*8
- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО*/
let number = +prompt('Введіть число');

number === 10 ? alert('Вірно') : alert('Невірно');

/*9
- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
    Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН*/
let temperature = +prompt('Яка температура');

temperature > 10 && temperature < 22
    ? alert('ми йдемо ВЧИТИСЯ')
    : alert('сидимо вдома і вчимося ОНЛАЙН');


/*10
- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
    числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .*/

let promptNumber = +prompt('Ведіть число від 1 до 5');

switch (promptNumber) {
    case 1:
        alert('Ваш приз: Авто');
        break;
    case 2:
        alert('Ваш приз: Мотоцикл');
        break;
    case 3:
        alert('Ваш приз: Телефон');
        break;
    case 4:
        alert('Ваш приз: Кулькова ручка');
        break;
    case 5:
        alert('Ваш приз: Мишка');
        break;
    default:
        alert('Ви нічого невиграли, бо число не вірне');
}